import React from "react";
import "./Testimonials.css";
import { Link } from "react-router-dom";
const reviews = [
  {
    heading: "➖➖ 25-09 21:35:08 ➖➖",
    text: "Все отлично",
  },
  {
    heading: "➖➖ 23-09 11:14:36 ➖➖",
    text: "10/10",
  },
  {
    heading: "➖➖ 10-09 02:34:23 ➖➖",
    text: "Сложно было найти, еле нашел больше случайно получилось",
  },
  {
    heading: "➖➖ 09-09 16:43:07 ➖➖",
    text: "😉",
  },
  {
    heading: "➖➖ 26-08 13:15:56 ➖➖",
    text: "Брал амф 2г. Через оператора.  ",
  },
  {
    heading: "➖➖ 25-08 16:03:06 ➖➖",
    text: "Найс хуй",
  },
  {
    heading: "➖➖ 11-08 08:38:39 ➖➖",
    text: "+",
  },
  {
    heading: "➖➖ 26-07 20:07:02 ➖➖",
    text: "Отлично",
  },
  {
    heading: "➖➖ 25-07 10:38:55 ➖➖",
    text: "Все четко, благодарю",
  },
  {
    heading: "➖➖ 20-07 20:42:05 ➖➖",
    text: "Нашел быстро, качество супер!",
  },
  {
    heading: "➖➖ 16-07 19:50:06 ➖➖",
    text: "Порядок...",
  },
  {
    heading: "➖➖ 11-07 13:17:23 ➖➖",
    text: "Все супер 😊\nЗа суммарных 8 кладов был один ненаход но времени что бы доказывать что либо просто небыло\nСапорт адекватный и быстро решали вопросы касательно платежи 🇺🇦",
  },
  {
    heading: "➖➖ 08-07 20:14:32 ➖➖",
    text: "Очень хороший магазин. Клады закопаны глубоко, но точно по описанию. Да И в случае проблем оператор успокоит И поможет все найти))) в общем крепкие 9/10",
  },
  {
    heading: "➖➖ 07-07 17:42:38 ➖➖",
    text: "Снял быстро, за пару секунд до ливня.\nБыло драйвово. Не закапывайте их так глубоко",
  },
  {
    heading: "➖➖ 22-06 13:04:32 ➖➖",
    text: "Спасибо",
  },
  {
    heading: "➖➖ 17-06 15:52:52 ➖➖",
    text: "все тип-топ!) товар - как всегда",
  },
  {
    heading: "➖➖ 16-06 22:15:35 ➖➖",
    text: "Пришлось немного покараться, но в итоге нашёл, качество как всегда топ!",
  },
  {
    heading: "➖➖ 10-06 10:20:42 ➖➖",
    text: "Клад забрал без проблем, товар классный",
  },
  {
    heading: "➖➖ 09-06 18:33:31 ➖➖",
    text: "Все тип-топ, как обычно) клад находится легко, место клада хорошее. Товар - бомба, дмет - классика жанра.\nПрозрачный кристал, идеально курится, 10/10.\nПрекрасный оператор, всегда поможет и подскажет, если что)\nСпасибо",
  },
  {
    heading: "➖➖ 11-05 14:03:53 ➖➖",
    text: "Хоть я уже не надеялся и даже сдался, но оператор прям заставил найти клад🙃 Нужно фоткать, ждать ответа оператора и все найдется🤗 Дмет красивый, но малость влажноват!😋",
  },
  {
    heading: "➖➖ 05-05 18:59:27 ➖➖",
    text: "Мне нравится смена локации и лёгкость снятия кладов. Супер!",
  },
  {
    heading: "➖➖ 01-05 11:37:57 ➖➖",
    text: "Все в огнях, в пол касания, стелс топ",
  },
  {
    heading: "➖➖ 29-04 13:25:19 ➖➖",
    text: "Не, ну такого у меня еще не было - съём с машины в касание! Подъехал по метке, открыл дверь, протянул руку к ттайнику и поехал дальше. Топ",
  },
  {
    heading: "➖➖ 05-04 16:45:23 ➖➖",
    text: "Огонь. Мдма - именно то, что надо",
  },
  // Добавьте остальные отзывы здесь
];

function Testimonials() {
  return (
    <section className="testimonials">
      <div className="container">
        {reviews.map((review, index) => (
          <div className="testimonial" key={index}>
            <h1 className="testimonial__heading">{review.heading}</h1>
            <p className="testimonial__text">{review.text}</p>
          </div>
        ))}

        <Link to="/createrew" className="testimonial__review-btn btn">Оставить отзыв</Link>
      </div>
    </section>
  );
}

export default Testimonials;
